# Pandas

<h3> Series </h3>

A series in pandas is similar to a numpy array with the difference that a series can be indexed by a label.

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]

arr = np.array(my_data)
d = {'a': 10, 'b' : 20, 'c' : 30}

In [3]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [7]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

A series can hold pretty much almost any type of data object with Python as its data point holding references to these build in functions as data points in the below panda series

In [9]:
pd.Series(data = [sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [10]:
ser1 = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])

In [11]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [12]:
ser2 = pd.Series([1, 2, 5, 4], ['USA', 'Germany', 'Italy', 'Japan'])

In [13]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [14]:
ser3 = pd.Series(data = labels)

In [15]:
ser3

0    a
1    b
2    c
dtype: object

In [16]:
ser3[0]

'a'

In [17]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [18]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [19]:
ser1 + ser2         # it tries to match up the operation based off the index, for USSR and Italy we would get NaN

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

<h3> DataFrames </h3>

In [20]:
from numpy.random import randn

In [21]:
# seed() makes sure that we get the same numbers
 
np.random.seed(101)

In [22]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [23]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Each of these columns is a pandas series, so W is a pandas series as well as X Y Z and they all share a common index and that's basically what dataframe is, its just a bunch of series that share an index

In [24]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [25]:
type(df['W'])

pandas.core.series.Series

In [26]:
type(df)

pandas.core.frame.DataFrame

In [27]:
df.W               # also works like database_name.table_name

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

If you want multiple columns, then pass a list of columns

In [28]:
df[['W', 'Z']]             # we get back a dataframe containing those series

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

If we ask for a single column then we get back a Series, if we ask for multiple cols. then we get a DataFrame

In [29]:
df['new'] = df['W'] + df['Y']

In [30]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

<b> df.drop() is used to drop a column, we need to specify axis as 1 to drop the column, axis 0 drops the row </b>

In [31]:
df.drop('new', axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

We need to specify inplace argument as True if you want changes to occur and stay in place.

In [33]:
df.drop('new', axis = 1, inplace = True)

In [34]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df.drop('E')                        # default value of axis is 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Row indexing start at 0, column indexing starts at 1; becuase of which rows are referred to as zero axis and columns are referred to as one axis

In [37]:
df.shape

(5, 4)

<h4> Selecting Rows </h4>

In [38]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

Rows are also Series

In [39]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

loc() is for location or labeled based index

<br>

iloc() is for numerical based index

In [40]:
# select subset of rows and columns

df.loc['B', 'Y']

-0.84807698340363147

In [41]:
df.loc[ ['A', 'B'] , ['W', 'Y'] ]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [42]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df > 0           # returns a dataframe with boolean values

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [44]:
booldf = df > 0

In [45]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [46]:
df[booldf]                           # we get values for points where booldf is True and NaN for False points

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df['W'] > 0                    # returns a Series

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [50]:
df[df['W'] > 0]                        # we only get back the rows where series(df['W'] > 0) contains True values

# we are getting back a DataFrame

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [52]:
resultdf = df[df['W'] > 0]

In [53]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [55]:
df[df['W'] > 0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [56]:
df[df['W'] > 0][['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

<h5> Multiple Conditions </h5>

and operator can take into account single boolean value at a time

In [57]:
df[(df['W'] > 0) and (df['Y'] > 1)]        # we are passing a series of boolean value to 'and' operator and that's why it gives an error

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [58]:
df[(df['W'] > 0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [59]:
df[(df['W'] > 0) | (df['Y'] > 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Pass each condition in parentheses and then use the & or | operator and put the entire thing in df[]

In [60]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [61]:
# gives numerical index and old index becomes a column of your dataframe

df.reset_index()               # need to specify inplace as True to make changes permanent

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [62]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [63]:
newind = 'CA NY WY OR CO'.split()

In [64]:
df['States'] = newind

In [65]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [66]:
# set_index is used to use an existing column as the index, it will not show the old index

# inplace needs to be specified

df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [67]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

<h3> Multi Indexing (Index higher key)</h3>

In [68]:
# index levels

outside_index = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside_index = [1, 2, 3, 1, 2, 3]

In [69]:
outside_index

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [70]:
inside_index

[1, 2, 3, 1, 2, 3]

In [71]:
hier_index = list(zip(outside_index, inside_index))

In [72]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [73]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [74]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [75]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])

In [76]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [77]:
df.loc['G1']                  # returns a dataframe

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [78]:
df.loc['G1'].loc[1]         # now we get a series

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [79]:
df.index.names

FrozenList([None, None])

In [80]:
df.index.names = ['Groups', 'Num']

In [81]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [82]:
df.loc['G2']

            A         B
Num
1    0.166905  0.184502
2    0.807706  0.072960
3    0.638787  0.329646

In [83]:
df.loc['G2'].loc[2]

A    0.807706
B    0.072960
Name: 2, dtype: float64

In [84]:
df.loc['G2'].loc[2]['B']

0.072959675317038689

<b> df.xs returns a cross section of rows and columns from a series or dataframe and we use this when dealing with multilevel index </b>

In [85]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [86]:
df.xs(1, level = 'Num')                 # gives the result from both groups where level Num happens to be equal to 1

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

<h3> Missing Data </h3>

In [87]:
d = {'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]}

In [88]:
df = pd.DataFrame(d)

In [89]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

<code> df.dropna() </code> drops any row with any single or more than 1 missing values, by default this methods has a value of 0 for axis </b>

In [90]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [91]:
df.dropna(axis = 1)         # drops columns containing nan values

   C
0  1
1  2
2  3

This method takes an argument thresh which is an integer and means that the method require this many non-Na values

In [92]:
df.dropna(thresh = 2)     # row 1 have 2 non-NA values, so it won't drop this row

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

df.fillna() is used to fill in missing values

In [93]:
df.fillna(value = 'FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [94]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [95]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

<h3> Groupby </h3>

In [96]:
data = { 'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       
          'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        
          'Sales': [200, 120, 340, 124, 243, 350] 
       }

In [97]:
df = pd.DataFrame(data)

In [98]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [99]:
df.groupby('Company')

In [100]:
byComp = df.groupby('Company')

In [101]:
byComp

In [102]:
byComp.mean()      # we didn't get Person col in the result as it contains only string, pandas automatically ignores any non-numeric column

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [103]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [104]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [105]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [106]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [107]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [108]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [109]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [110]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [111]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [112]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

<h3> Merging, Joining, and Concatenation </h3>

<p> There are 3 ways of combining DataFrames together: Merging, Joining, and Concatenation. </p>

In [113]:
df1 = pd.DataFrame(

                   {

                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']
                    
                    },  index = [0, 1, 2, 3])

In [114]:
df2 = pd.DataFrame(

                   {

                    'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']
                    
                    },  index = [4, 5, 6, 7])

In [115]:
df3 = pd.DataFrame(

                   {

                    'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']
                    
                    },  index = [8, 9, 10, 11])

In [116]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [117]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [118]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

<h3> Concatenation </h3>

<p> Concatenation basically glues together DdataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use <b> pd.concat </b> and pass in a list of DataFrames to concatenate together. </p>

In [119]:
pd.concat([df1, df2, df3])     # by default this joins rows together

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [120]:
pd.concat([df1, df2, df3], axis = 1)             # we can use axis as 1 to concatenate column wise

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

we have missing values because these dataframes didn't have the values for the indices that you wanted to concatenate on.

<h3> Merging </h3>

<p> The merging function allows you to merge DataFrames together using a similar logic as merging SQL tables together </p>

In [121]:
left = pd.DataFrame({
                      'key': ['KO', 'K1', 'K2', 'K3'],
                      'A'  : ['A0', 'A1', 'A2', 'A3'],
                      'B'  : ['B0', 'B1', 'B2', 'B3'] 
                   })

In [122]:
right = pd.DataFrame({
                      'key': ['KO', 'K1', 'K2', 'K3'],
                      'C'  : ['C0', 'C1', 'C2', 'C3'],
                      'D'  : ['D0', 'D1', 'D2', 'D3'] 
                   })

In [123]:
left

    A   B key
0  A0  B0  KO
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [124]:
right

    C   D key
0  C0  D0  KO
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [125]:
# merges two dataframes based on 1 or more common columns between them

pd.merge(left, right, how='inner', on = 'key' )

    A   B key   C   D
0  A0  B0  KO  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [172]:
left = pd.DataFrame({
                      'key1': ['KO', 'K0', 'K1', 'K2'],
                      'key2': ['K0', 'K1', 'K0', 'K1'],
                      'A'  : ['A0', 'A1', 'A2', 'A3'],
                      'B'  : ['B0', 'B1', 'B2', 'B3'] 
                   })



right = pd.DataFrame({
                      'key1': ['KO', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'C'  : ['C0', 'C1', 'C2', 'C3'],
                      'D'  : ['D0', 'D1', 'D2', 'D3'] 
                   })

In [173]:
left

    A   B key1 key2
0  A0  B0   KO   K0
1  A1  B1   K0   K1
2  A2  B2   K1   K0
3  A3  B3   K2   K1

In [174]:
right

    C   D key1 key2
0  C0  D0   KO   K0
1  C1  D1   K1   K0
2  C2  D2   K1   K0
3  C3  D3   K2   K0

In [127]:
pd.merge(left, right, on = ['key1', 'key2'])    

# each key pair(key1, key2) in left is matched with all the key pairs in right and all the rows based on this are returned

    A   B key1 key2   C   D
0  A0  B0   KO   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [128]:
pd.merge(left, right, how = 'outer', on = ['key1', 'key2'])     # all key pairs are listed

     A    B key1 key2    C    D
0   A0   B0   KO   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [129]:
pd.merge(left, right, how = 'right', on = ['key1', 'key2'])

     A    B key1 key2   C   D
0   A0   B0   KO   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

In [130]:
pd.merge(left, right, how = 'left', on = ['key1', 'key2'])

    A   B key1 key2    C    D
0  A0  B0   KO   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

<h3> Joining </h3>

Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

Think of it as merge except the keys you want to join on are actually index instead of a column.

In [175]:
left = pd.DataFrame({
                      
                      'A'  : ['A0', 'A1', 'A2'],
                      'B'  : ['B0', 'B1', 'B2']
                    },index = ['K0', 'K1', 'K2'])


right = pd.DataFrame({
                      'C'  : ['C0', 'C1', 'C2'],
                      'D'  : ['D0', 'D1', 'D2'] 
                     },index = ['K0', 'K2', 'K3'])

In [176]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [177]:
right

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [132]:
left.join(right)             # automatically will do inner join between left and the right based on the index keys

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

If you want to join these dataframes based on one of there columns, you have to use merge

In [133]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

<h3> Operations </h3>

In [134]:
df = pd.DataFrame({ 'col1' : [1, 2, 3, 4],
                    'col2' : [444, 555, 666, 444],
                    'col3' : ['abc', 'def', 'ghi', 'xyz']
                  })

In [135]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [136]:
df['col2'].unique()          # gives unique values in col2

array([444, 555, 666], dtype=int64)

In [137]:
len(df['col2'].unique())         # gives no. of unique values in col2

3

In [138]:
df['col2'].nunique()             # gives no. of unique values in col2

3

In [139]:
df['col2'].value_counts()        # gives you a table of unique values and the count of each of the unique value

444    2
555    1
666    1
Name: col2, dtype: int64

In [140]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [141]:
df[df['col1'] > 2]               # returns all the rows of the DataFrame where col1 appears to be grater than 2

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [142]:
df['col1'] > 2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [143]:
def times2(x):
    return x*2

In [144]:
df['col1'].sum()

10

In [145]:
df['col1'].apply(times2)              # apply method of dataframe is used to apply any user defined function on dataframe

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [146]:
df['col3']

0    abc
1    def
2    ghi
3    xyz
Name: col3, dtype: object

In [147]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [148]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [149]:
df.drop('col1', axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [150]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [151]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [152]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [153]:
df.sort_values(by = 'col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [154]:
df.isnull()                   # returns a dataframe of booleans indicating whether the value was null or not

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [155]:
data = {
         'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
         'B': ['one', 'one', 'two', 'two', 'one', 'one'],
         'C': ['x', 'y', 'x', 'y', 'x', 'y'],
         'D': [1, 3, 2, 5, 4, 1]      
       }

df = pd.DataFrame(data)

In [156]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [157]:
# we have repeating values in column A, B and C

In [158]:
# we can create a multi-index out of this table/dataframe

# pivot_table takes in three main arguments, the values, index and the columns

In [159]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [160]:
# in this case, we want values to be from column D

# index is specifies as A and B and that basically gonna make A and B into a multi level index

# and we want actual columns to be C

df.pivot_table(values = 'D', index = ['A', 'B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

There is no entry for 'bar two x' and that's why it is reflected as NaN in the result set of pivot table

<h3> Data Input Output </h3>

In [161]:
pwd

'C:\\Users\\HELLO\\Desktop\\e-learning code\\wipro udemy\\python and machine learning bootcamp\\section 6 pandas'

In [162]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [163]:
df = pd.read_csv('example.csv')

In [164]:
df.to_csv('MyOutput', index = False)  

# index = False as we don't want to write the index into the csv file
# no need to include .csv extension

In [165]:
df.to_csv('MyOutput1')

In [166]:
pd.read_csv('MyOutput1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

Pandas can read and write the excel files. Pandas can only import the data, it can't import formulas or images or things like macros

Each sheet in the excel file is just like a DataFrame

In [167]:
pd.read_excel('example.xlsx', sheetname = 'Sheet1')

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [168]:
df.to_excel('example2.xlsx', sheet_name = 'NewSheet')

In [169]:
# go through screenshot 17164 - 17184 to know how to handle input output in html and sql